app/controllers/users_controller.rb

INSERT INTO "users" ("firstname", "lastname", "email", "phonenumber", "numofentry", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    # Set your secret key: remember to change this to your live secret key in production
    # See your keys here: https://dashboard.stripe.com/account/apikeys
    Stripe.api_key = "sk_test_UvxMcForqn5nLLDFHPAU7w7h"

    # Get the credit card details submitted by the form
    #token = "tok_18oe6uJ8yuI4bDlnrdhQMPvh"
     token = params[:user][:token][:id]
      entry = eval( params[:user][:numofentry])
   # Create a charge: this will charge the user's card
    begin
     charge = Stripe::Charge.create(
       :amount => 200 * entry, # Amount in cents
       :currency => "usd",
       :source => token,
       :description => "Example charge"
     )
     rescue Stripe::CardError => e
     # The card has been declined
    end

    if @user.save